<a href="https://colab.research.google.com/github/teeranutp/code-everyday002/blob/master/Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [21]:
df[["total_bedrooms"]]

       total_bedrooms
0              1283.0
1              1901.0
2               174.0
3               337.0
4               326.0
...               ...
16995           394.0
16996           528.0
16997           531.0
16998           552.0
16999           300.0

[17000 rows x 1 columns]

In [16]:
df.groupby(["median_house_value"])[["total_bedrooms","median_income"]].agg(["min","max"])

                   total_bedrooms         median_income
                              min     max           min      max
median_house_value
14999.0                      28.0   267.0        0.5360   4.1932
17500.0                     168.0   168.0        2.3667   2.3667
22500.0                      73.0  1743.0        0.7917   2.7138
25000.0                      33.0    33.0        0.8571   0.8571
26600.0                     309.0   309.0        2.3013   2.3013
...                           ...     ...           ...      ...
498800.0                    269.0   269.0        8.2480   8.2480
499000.0                    735.0   735.0        8.1489   8.1489
499100.0                    297.0   297.0        6.7861   6.7861
500000.0                     41.0  1330.0        1.2656   6.0199
500001.0                      1.0  2611.0        0.4999  15.0001

[3694 rows x 4 columns]